saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuVoice_ISD_DFP.1.0.1.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Nuvoton</vendor>
  <url>http://www.nuvoton.com/hq/enu/Documents/KEILSoftwarePack</url>
  <name>NuVoice_ISD_DFP</name>
  <description>Nuvoton ARM Cortex-M NuVoice and ISD Family Device Support</description>

  <releases>
    <release version="1.0.1" date="2018-11-28">
      First Release version of NuVoice and ISD Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Nuvoton</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Nuvoton</keyword>
    <keyword>NuVoice</keyword>
	<keyword>ISD</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="ISD Family" Dvendor="Nuvoton:18">
      <!-- *************************  Subfamily 'I9160 Series'  ***************************** -->
      <subFamily DsubFamily="I9160 Series">
		<description>The I9160 series is a ARM Cortex-M0 32-bit microcontroller.</description>
        <!-- *************************  Device 'I9130'  ***************************** -->
        <device Dname="I9130">
          <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD9100_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\ISD9100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash\ISD9100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash\ISD9100_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="24"/>
        <feature type="Timer"  		n="3"	m="24"/>
        <feature type="UART"  		n="1"/>
        <feature type="SPI"  		n="1"/>
        <feature type="I2C"  		n="1"/>
        <feature type="I2S"  		n="1"/>
        <feature type="AnalogOther"	n="2"/>
        <feature type="PWM"  		n="2"	m="16"/>
        <feature type="ADC"  		n="8"	m="16"/>
		</device>

        <!-- *************************  Device 'I9160'  ***************************** -->
        <device Dname="I9160">
          <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD9100_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x24400"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\ISD9100_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash\ISD9100_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash\ISD9100_AP_145.FLM"        start="0x00000000"  size="0x24400"                   default="1"/>
        <feature type="IOs"  		n="24"/>
        <feature type="Timer"  		n="3"	m="24"/>
        <feature type="UART"  		n="1"/>
        <feature type="SPI"  		n="1"/>
        <feature type="I2C"  		n="1"/>
        <feature type="I2S"  		n="1"/>
        <feature type="AnalogOther"	n="2"/>
        <feature type="PWM"  		n="2"	m="16"/>
        <feature type="ADC"  		n="8"	m="16"/>
		</device>
      </subFamily>
	
      <!-- *************************  Subfamily 'I91300 Series'  ***************************** -->
      <subFamily DsubFamily="I91300 Series">	
		<description>The I91300 series is a ARM Cortex-M0 32-bit microcontroller.</description>
        <!-- *************************  Device 'I91361'  ***************************** -->
        <device Dname="I91361">
          <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD9300_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x24400"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\ISD9300_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash\ISD9300_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash\ISD9300_AP_145.FLM"        start="0x00000000"  size="0x24400"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="24"/>
        <feature type="UART"  		n="1"/>
        <feature type="SPI"  		n="1"/>
        <feature type="I2C"  		n="1"/>
        <feature type="I2S"  		n="1"/>
        <feature type="AnalogOther"	n="2"/>
        <feature type="PWM"  		n="6"	m="16"/>
        <feature type="ADC"  		n="16"	m="16"/>
        <feature type="QFP"  		n="48"/>
		</device>

        <!-- *************************  Device 'I91360'  ***************************** -->
        <device Dname="I91360">
          <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD9300_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x24400"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\ISD9300_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash\ISD9300_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash\ISD9300_AP_145.FLM"        start="0x00000000"  size="0x24400"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="24"/>
        <feature type="UART"  		n="1"/>
        <feature type="SPI"  		n="1"/>
        <feature type="I2C"  		n="1"/>
        <feature type="I2S"  		n="1"/>
        <feature type="AnalogOther"	n="2"/>
        <feature type="PWM"  		n="6"	m="16"/>
        <feature type="ADC"  		n="16"	m="16"/>
        <feature type="QFP"  		n="48"/>
		</device>

