saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuVoice_ISD_DFP.1.0.1.pdsc
        <!-- *************************  Device 'I91341'  ***************************** -->
        <device Dname="I91341">
          <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD9300_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x18000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\ISD9300_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash\ISD9300_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash\ISD9100_AP_96.FLM"        start="0x00000000"  size="0x18000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="24"/>
        <feature type="UART"  		n="1"/>
        <feature type="SPI"  		n="1"/>
        <feature type="I2C"  		n="1"/>
        <feature type="I2S"  		n="1"/>
        <feature type="AnalogOther"	n="2"/>
        <feature type="PWM"  		n="6"	m="16"/>
        <feature type="ADC"  		n="16"	m="16"/>
        <feature type="QFP"  		n="48"/>
		</device>

        <!-- *************************  Device 'I91340'  ***************************** -->
        <device Dname="I91340">
          <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD9300_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x18000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\ISD9300_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash\ISD9300_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash\ISD9300_AP_96.FLM"        start="0x00000000"  size="0x18000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="24"/>
        <feature type="UART"  		n="1"/>
        <feature type="SPI"  		n="1"/>
        <feature type="I2C"  		n="1"/>
        <feature type="I2S"  		n="1"/>
        <feature type="AnalogOther"	n="2"/>
        <feature type="PWM"  		n="6"	m="16"/>
        <feature type="ADC"  		n="16"	m="16"/>
        <feature type="QFP"  		n="48"/>
		</device>
      </subFamily>
	 
      <!-- *************************  Subfamily 'I91000 Series'  ***************************** -->
      <subFamily DsubFamily="I91000 Series">	
		<description>The I91000 series is a ARM Cortex-M0 32-bit microcontroller.</description>	  
        <!-- *************************  Device 'I91032'  ***************************** -->
        <device Dname="I91032">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD91000_v4_2.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\I91000_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>
      </subFamily>

      <!-- *************************  Subfamily 'I91200 Series'  ***************************** -->
      <subFamily DsubFamily="I91200 Series">		
		<description>The I91200 series is a ARM Cortex-M0 32-bit microcontroller.</description>	  
        <!-- *************************  Device 'I91260'  ***************************** -->
        <device Dname="I91260">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD91200B_v1.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\I91200_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="2"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
        <feature type="ADC"  		n="8"	m="16"/>
		</device>
		
        <!-- *************************  Device 'I91260C'  ***************************** -->
        <device Dname="I91260C">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD91200B_v1.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\I91200_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="2"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
        <feature type="ADC"  		n="8"	m="16"/>
		</device>
		
        <!-- *************************  Device 'I91260B'  ***************************** -->
        <device Dname="I91260B">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD91200B_v1.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x20000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\I91200_AP_128.FLM"        start="0x00000000"  size="0x20000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="2"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
        <feature type="ADC"  		n="8"	m="16"/>
		</device>
		
        <!-- *************************  Device 'I91230'  ***************************** -->
        <device Dname="I91230">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD91200B_v1.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\I91200_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="2"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
        <feature type="ADC"  		n="8"	m="16"/>
		</device>
		
        <!-- *************************  Device 'I91230C'  ***************************** -->
        <device Dname="I91230C">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\ISD91200B_v1.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\I91200_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="2"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
        <feature type="ADC"  		n="8"	m="16"/>
		</device>
      </subFamily>
	  
      <!-- *************************  Subfamily 'I94000 Series'  ***************************** -->
      <subFamily DsubFamily="I94000 Series">
		<description>The I94100 series is a ARM Cortex-M4 32-bit microcontroller.</description>
        <!-- *************************  Device 'I94120'  ***************************** -->
        <device Dname="I94120">
		  <processor  Dcore="Cortex-M4"  Dclock="20000000"/>
          <debug      svd   ="SVD\Nuvoton\I94100_v1_3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x80000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x28000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\I94000_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash\I94000_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash\I94000_AP_512.FLM"        start="0x00000000"  size="0x80000"                   default="1"/>
        <feature type="IOs"  		n="26"/>
        <feature type="Timer"  		n="4"	m="32"/>
        <feature type="UART"  		n="6"/>
        <feature type="SPI"  		n="3"/>
        <feature type="I2C"  		n="3"/>
        <feature type="USBD"  		n="1"/>
        <feature type="I2S"  		n="1"/>
        <feature type="AnalogOther"	n="2"/>
        <feature type="PWM"  		n="24"	m="16"/>
        <feature type="ADC"  		n="16"	m="12"/>
        <feature type="DAC"  		n="2"	m="12"/>
        <feature type="QFN"  		n="33"/>
		</device>
      </subFamily>
    </family>
	
    <family Dfamily="NuVoice Family" Dvendor="Nuvoton:18">
      <!-- *************************  Subfamily 'N569S Series'  ***************************** -->
      <subFamily DsubFamily="N569S Series">
		<description>The N569S series is a ARM Cortex-M0 32-bit microcontroller(include SPIFlash).</description>		
        <!-- *************************  Device 'N569S'  ***************************** -->
        <device Dname="N569S">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N569S.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N569_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
		</device>
        
		<!-- *************************  Device 'N569S1K0' backward compitable ***************** -->
        <device Dname="N569S1K0">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N569S.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N569_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
		</device>
		
		<!-- *************************  Device 'N569S1K5' backward compitable ***************** -->
        <device Dname="N569S1K5">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N569S.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N569_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
		</device>
		
		<!-- *************************  Device 'N569S250' backward compitable ***************** -->
        <device Dname="N569S250">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N569S.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N569_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
		</device>
		
		<!-- *************************  Device 'N569S2K0' backward compitable ***************** -->
        <device Dname="N569S2K0">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N569S.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N569_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
		</device>
		
		<!-- *************************  Device 'N569S3K0' backward compitable ***************** -->
        <device Dname="N569S3K0">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N569S.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N569_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
		</device>
		
		<!-- *************************  Device 'N569S4K0' backward compitable ***************** -->
        <device Dname="N569S4K0">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N569S.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N569_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
		</device>
		<!-- *************************  Device 'N569S500' backward compitable ***************** -->
        <device Dname="N569S500">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N569S.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N569_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
		</device>
		
		<!-- *************************  Device 'N569S750' backward compitable ***************** -->
        <device Dname="N569S750">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N569S.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N569_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
		</device>
	  </subFamily>
	  
      <!-- *************************  Subfamily 'N570S Series'  ***************************** -->
      <subFamily DsubFamily="N570S Series">
		<description>The N570S series is a ARM Cortex-M0 32-bit microcontroller(include SPIFlash).</description>		
        <!-- *************************  Device 'N570S'  ***************************** -->
        <device Dname="N570S">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N570F064_v4_2.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N570_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>
	  </subFamily>
	  
      <!-- *************************  Subfamily 'N572S Series'  ***************************** -->
      <subFamily DsubFamily="N572S Series">
		<description>The N572S series is a ARM Cortex-M0 32-bit microcontroller(include SPIFlash).</description>	
        <!-- *************************  Device 'N572S'  ***************************** -->
        <device Dname="N572S">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N572F072_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x12000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N572Fxxx.FLM"        start="0x00000000"  size="0x12000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>
	  </subFamily>
	  
      <!-- *************************  Subfamily 'N575S Series'  ***************************** -->
      <subFamily DsubFamily="N575S Series">
		<description>The N575S series is a ARM Cortex-M0 32-bit microcontroller(include SPIFlash).</description>			
        <!-- *************************  Device 'N575S'  ***************************** -->
        <device Dname="N575S">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N575F145_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x24400"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N575_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash\N575_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash\N575_AP_145.FLM"        start="0x00000000"  size="0x24400"                   default="1"/>
        <feature type="IOs"  		n="24"/>
        <feature type="Timer"  		n="3"	m="24"/>
        <feature type="UART"  		n="1"/>
        <feature type="SPI"  		n="1"/>
        <feature type="I2C"  		n="1"/>
        <feature type="I2S"  		n="1"/>
        <feature type="AnalogOther"	n="2"/>
        <feature type="PWM"  		n="2"	m="16"/>
        <feature type="ADC"  		n="8"	m="16"/>
		</device>
	  </subFamily>
	  
