saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Nuvoton.NuVoice_ISD_DFP.1.0.1.pdsc
      <!-- *************************  Subfamily 'N570 Series'  ***************************** -->
      <subFamily DsubFamily="N570 Series">
		<description>The N570 series is a ARM Cortex-M0 32-bit microcontroller.</description>		
        <!-- *************************  Device 'N570F064'  ***************************** -->
        <device Dname="N570F064">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N570F064_v4_2.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N570_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>

        <!-- *************************  Device 'N570C064'  ***************************** -->
        <device Dname="N570C064">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N570F064_v4_2.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N570_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="22"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>
		
		<!-- *************************  Device 'N570H064'  ***************************** -->
        <device Dname="N570H064">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N570H064.svd"/> <!--Fixed-->
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N570_AP_64.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="28"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="1"/>
        <feature type="PWM"  		n="2"	m="16"/>
        <feature type="ADC"  		n="5"	m="12"/>
		</device>
	  </subFamily>
	  
      <!-- *************************  Subfamily 'N572 Series'  ***************************** -->
      <subFamily DsubFamily="N572 Series">
		<description>The N572 series is a ARM Cortex-M0 32-bit microcontroller.</description>		
        <!-- *************************  Device 'N572F065'  ***************************** -->
        <device Dname="N572F065">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N572F065_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N572Fxxx.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
		<feature type="USBD" 		n="1"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>

        <!-- *************************  Device 'N572F072'  ***************************** -->
        <device Dname="N572F072">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N572F072_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x12000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N572Fxxx.FLM"        start="0x00000000"  size="0x12000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>

        <!-- *************************  Device 'N572P072'  ***************************** -->
        <device Dname="N572P072">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N572F072_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x12000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N572Fxxx.FLM"        start="0x00000000"  size="0x12000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>
		
        <!-- *************************  Device 'N572C065'  ***************************** -->
        <device Dname="N572C065">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N572F065_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x10000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N572Fxxx.FLM"        start="0x00000000"  size="0x10000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
		<feature type="USBD" 		n="1"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>
		
        <!-- *************************  Device 'N572C072'  ***************************** -->
        <device Dname="N572C072">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N572F072_v3.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x12000"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N572Fxxx.FLM"        start="0x00000000"  size="0x12000"                   default="1"/>
        <feature type="IOs"  		n="32"/>
        <feature type="Timer"  		n="3"	m="16"/>
        <feature type="SPI"  		n="2"/>
        <feature type="PWM"  		n="4"	m="16"/>
        <feature type="ADC"  		n="8"	m="12"/>
		</device>
	  </subFamily>

      <!-- *************************  Subfamily 'N575 Series'  ***************************** -->
      <subFamily DsubFamily="N575 Series">
		<description>The N575 series is a ARM Cortex-M0 32-bit microcontroller.</description>		
        <!-- *************************  Device 'N575F145'  ***************************** -->
        <device Dname="N575F145">
		  <processor  Dcore="Cortex-M0"  Dclock="48000000"/>
          <debug      svd   ="SVD\Nuvoton\N575F145_v1.svd"/>
          <memory     id="IROM1"    start="0x00000000"  size="0x24400"     startup="1"   default="1"/>
          <memory     id="IRAM1"    start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <algorithm  name  ="Flash\N575_CFG.FLM"         start="0x00300000"  size="0x00000004"                   default="0"/>
          <algorithm  name  ="Flash\N575_LD_4.FLM"        start="0x00100000"  size="0x1000"                   default="0"/>
          <algorithm  name  ="Flash\N575_AP_145.FLM"        start="0x00000000"  size="0x24400"                   default="1"/>
        <feature type="IOs"  		n="24"/>
        <feature type="Timer"  		n="3"	m="24"/>
        <feature type="UART"  		n="1"/>
        <feature type="SPI"  		n="1"/>
        <feature type="I2C"  		n="1"/>
        <feature type="I2S"  		n="1"/>
        <feature type="AnalogOther"	n="2"/>
        <feature type="PWM"  		n="2"	m="16"/>
        <feature type="ADC"  		n="8"	m="16"/>
		</device>

